In [1]:
import pandas as pd
import spacy

In [2]:
df_raw = pd.read_csv('data/gsearch_jobs.csv')

In [3]:
df_raw.head()

,Unnamed: 0,index,title,company_name,location,via,description,extensions,job_id,thumbnail,...,commute_time,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst,Cisco Meraki,Anywhere,via LinkedIn,"As the leader in cloud-managed IT, Cisco Merak...","['22 hours ago', 'Work from home', 'Full-time'...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['sql', 'aws', 'tableau']"
1,1,1,Entry Level - Business Data Analyst (Remote),Midwest Staffing,Anywhere,via LinkedIn,As a Senior Business Analyst you will contribu...,"['53 minutes ago', 'Work from home', 'Full-tim...",eyJqb2JfdGl0bGUiOiJFbnRyeSBMZXZlbCAtIEJ1c2luZX...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,[]
2,2,2,Data Analyst/Researcher,"Amyx, Inc.",United States,via Indeed,Overview:\n\nAmyx is seeking to hire a Data An...,"['3 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QvUmVzZWFyY2...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['azure', 'sql', 'excel']"
3,3,3,Data analyst/AI expert to help build a website...,Upwork,Anywhere,via Upwork,I am looking for someone to help me build an A...,"['23 hours ago', 'Work from home', 'Contractor']",eyJqb2JfdGl0bGUiOiJEYXRhIGFuYWx5c3QvQUkgZXhwZX...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['excel']
4,4,4,Data Analyst,Bank Street College of Education,United States,via Higher Education Recruitment Consortium (H...,Position Vacancy – Data Analyst to support the...,"['20 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'powerpoint']"

In [ ]:
df_raw.info()
df_raw.shape

In [4]:
#cleaning section
df = df_raw.drop(
    ["job_id",
      "thumbnail" ,
      "commute_time",
      "salary_pay", # as we have min-max
      "salary_hourly",
      "Unnamed: 0",
      "posted_at",
       ],
      axis = 1
      )
df.tail()

,index,title,company_name,location,via,description,extensions,schedule_type,work_from_home,salary,search_term,date_time,search_location,salary_rate,salary_avg,salary_min,salary_max,salary_yearly,salary_standardized,description_tokens
42146,524,Marketing Data & BI Analyst II,EDWARD JONES,"Houstonia, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '76,798–130,764 a year', 'Ful...",Full-time,NaN,"76,798–130,764 a year",data analyst,2022-11-04 03:40:23.706734,United States,a year,103781.0,76798.0,130764.0,103781.0,103781.0,"['snowflake', 'sql', 'excel', 'tableau', 'powe..."
42147,525,Lead-Data Analyst,EDWARD JONES,"Marshfield, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,NaN,"106,916–182,047 a year",data analyst,2022-11-24 04:00:08.710801,United States,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[]
42148,526,Lead-Data Analyst,EDWARD JONES,"High Point, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,NaN,"106,916–182,047 a year",data analyst,2022-12-07 04:00:12.563831,United States,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[]
42149,527,Lead-Data Analyst,EDWARD JONES,"Calhoun, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,NaN,"106,916–182,047 a year",data analyst,2022-12-08 04:00:15.975728,United States,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[]
42150,528,Institutional Credit Management - Lending Data...,Citi,United States,via My ArkLaMiss Jobs,The Institutional Credit Management (ICM) grou...,"['24 hours ago', '105,850–158,780 a year', 'Fu...",Full-time,NaN,"105,850–158,780 a year",data analyst,2023-01-25 04:00:26.521124,United States,a year,132315.0,105850.0,158780.0,132315.0,132315.0,"['cognos', 'tableau']"

In [5]:
# converting to types, "description_tokens" still object
df[["title", "description", "company_name", "location", "via", "extensions", "schedule_type", "search_term", "search_location", "salary", "salary_rate"]] = df[["title", "description", "company_name", "location", "via", "extensions", "schedule_type", "search_term", "search_location", "salary", "salary_rate"]].astype("string")
df["work_from_home"] = df["work_from_home"].astype("bool")
df["date_time"] = pd.to_datetime(df["date_time"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42151 entries, 0 to 42150
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   index                42151 non-null  int64
 1   title                42151 non-null  string
 2   company_name         42151 non-null  string
 3   location             42122 non-null  string
 4   via                  42142 non-null  string
 5   description          42151 non-null  string
 6   extensions           42151 non-null  string
 7   schedule_type        41974 non-null  string
 8   work_from_home       42151 non-null  bool
 9   salary               7220 non-null   string
 10  search_term          42151 non-null  string
 11  date_time            42151 non-null  datetime64[ns]
 12  search_location      42151 non-null  string
 13  salary_rate          7220 non-null   string
 14  salary_avg           7220 non-null   float64
 15  salary_min           6834 non-null   float64
 16  salary_max           6834 non-null   float64
 17  salary_yearly        2549 non-null   float64
 18  salary_standardized  7220 non-null   float64
 19  description_tokens   42151 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(5), int64(1), object(1), string(11)
memory usage: 6.2+ MB

In [6]:
#covert to lower strings
# title and description changed back to object type --> "Data Analyst II" is now "data analyst ii"
df["title"] = df["title"].apply(lambda x: x.lower() if isinstance(x, str) else x)
df["description"] = df["description"].apply(lambda x: x.lower() if isinstance(x, str) else x)
df["via"] = df["via"].apply(lambda x: x.lower() if isinstance(x, str) else x)

df[["title", "description", "via"]] = df[["title", "description", "via"]].astype("string")
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42151 entries, 0 to 42150
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   index                42151 non-null  int64
 1   title                42151 non-null  string
 2   company_name         42151 non-null  string
 3   location             42122 non-null  string
 4   via                  42142 non-null  string
 5   description          42151 non-null  string
 6   extensions           42151 non-null  string
 7   schedule_type        41974 non-null  string
 8   work_from_home       42151 non-null  bool
 9   salary               7220 non-null   string
 10  search_term          42151 non-null  string
 11  date_time            42151 non-null  datetime64[ns]
 12  search_location      42151 non-null  string
 13  salary_rate          7220 non-null   string
 14  salary_avg           7220 non-null   float64
 15  salary_min           6834 non-null   float64
 16  salary_max           6834 non-null   float64
 17  salary_yearly        2549 non-null   float64
 18  salary_standardized  7220 non-null   float64
 19  description_tokens   42151 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(5), int64(1), object(1), string(11)
memory usage: 6.2+ MB

In [7]:
#Getting to know the dataset
display(df["location"].value_counts())
germany = df["location"].value_counts().get('Germany')
print(germany)
display(df["title"].value_counts())

location
 Anywhere                 11983
  United States            7964
Anywhere                   7094
United States              3660
  Oklahoma City, OK         818
                          ...
Mountain View, AR             1
Chickasha, OK                 1
  Ada, OK                     1
  Silver Lake, KS             1
Sand Springs, OK              1
Name: count, Length: 712, dtype: Int64

None

title
data analyst                                           5198
senior data analyst                                    1381
data scientist                                          579
data analyst ii                                         530
business data analyst                                   408
                                                       ...
business intelligence analyst -remote                     1
principal analytical data engineer - healthcare           1
data quality analyst - ( german/ french) - remote         1
business data & reporting analyst – hybrid | 975913       1
lead fp&a analyst- remote, us                             1
Name: count, Length: 15347, dtype: Int64

In [8]:
# checking how many data analyst and scientists / may still overlap
df["is_analyst"] = df["title"].str.contains("analyst", case=False) & ~ df["title"].str.contains("business analyst", case=False) # analyst but not business analyst
print(df["is_analyst"].sum())
# df["check"] = df["title"].str.contains("business analyst", case=False) # 791, correct
df["is_bi_analyst"] = df["title"].str.contains("business data analyst", case=False)
print(df["is_bi_analyst"].sum())
df["is_scien"] = df["title"].str.contains("scient" or "scienc", case=False)
print(df["is_scien"].sum())
df.tail()

32261
926
1784

,index,title,company_name,location,via,description,extensions,schedule_type,work_from_home,salary,...,salary_rate,salary_avg,salary_min,salary_max,salary_yearly,salary_standardized,description_tokens,is_analyst,is_bi_analyst,is_scien
42146,524,marketing data & bi analyst ii,EDWARD JONES,"Houstonia, MO",via my arklamiss jobs,"at edward jones, we help clients achieve their...","['23 hours ago', '76,798–130,764 a year', 'Ful...",Full-time,True,"76,798–130,764 a year",...,a year,103781.0,76798.0,130764.0,103781.0,103781.0,"['snowflake', 'sql', 'excel', 'tableau', 'powe...",True,False,False
42147,525,lead-data analyst,EDWARD JONES,"Marshfield, MO",via my arklamiss jobs,"at edward jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,True,"106,916–182,047 a year",...,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[],True,False,False
42148,526,lead-data analyst,EDWARD JONES,"High Point, MO",via my arklamiss jobs,"at edward jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,True,"106,916–182,047 a year",...,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[],True,False,False
42149,527,lead-data analyst,EDWARD JONES,"Calhoun, MO",via my arklamiss jobs,"at edward jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",Full-time,True,"106,916–182,047 a year",...,a year,144481.5,106916.0,182047.0,144481.5,144481.5,[],True,False,False
42150,528,institutional credit management - lending data...,Citi,United States,via my arklamiss jobs,the institutional credit management (icm) grou...,"['24 hours ago', '105,850–158,780 a year', 'Fu...",Full-time,True,"105,850–158,780 a year",...,a year,132315.0,105850.0,158780.0,132315.0,132315.0,"['cognos', 'tableau']",True,False,False

In [9]:
# checking
# filtering for df["is_scien"] based on boolean indexing when df[df["is_scien"]] is true
filtered_df = df[df["is_scien"]]

# manual inspection
print(filtered_df[["title", "is_scien"]])

                                                   title  is_scien
25                                 remote data scientist      True
174                                   sr. data scientist      True
175                                       data scientist      True
219         sr manager product analytics/ data scientist      True
326                                       data scientist      True
...                                                  ...       ...
41159  senior data scientist - supply chain (sam's club)      True
41160  senior data scientist - supply chain (sam's club)      True
41161  senior data scientist - supply chain (sam's club)      True
41162  senior data scientist - supply chain (sam's club)      True
41772  remote data scientist (data analyst applicatio...      True

[1784 rows x 2 columns]

In [10]:
#where jobs are from, glassdoor = 0, 
#FIX ME , there was the word indeed, but doesnt show here
df["via"].str.contains("indeed").sum()

df["via"].str.contains("glassdoor").sum()
indexes_with_glassdoor = df[df["via"].str.contains("glassdoor")].index
print(indexes_with_glassdoor)
df["via"].loc[12579]
df["date_time"].loc[12444]

Index([12444, 12579], dtype='int64')

Timestamp('2022-11-04 15:36:57.785729')

In [11]:
#remove all that is not analyst or science
#df_cleaned = df[(df["is_analyst"] == True) | (df["is_scien"] == True) &  ((df["is_analyst"] == True) & (df["is_scien"] == True))] # sanity check
df_cleaned = df[(df["is_analyst"] == True) | (df["is_scien"] == True)]
# df_cleaned7 = df[(df["is_analyst"] == True) & ~ (df["is_scien"] == True) & ~ (df["is_analyst"] == True) & (df["is_scien"] == True)]
# df_cleaned2 = df[(df["is_analyst"] == True)]
# df_cleaned3 = df[(df["is_scien"] == True)]

print(df_cleaned.shape)
# print(df_cleaned7.shape)
# print(df_cleaned2.shape)
# print(df_cleaned3.shape)
df_main = df_cleaned.copy()

(33836, 23)

In [ ]:
#starting tokenization
skills_list = ["python", "sql", "tableau", "bi tool", "power bi", "aws", "azure", "excel", "powerpoint"]  # start with these two skills

# create new columns for each skill
for skill in skills_list:
    df_main[skill] = df['description'].apply(lambda x: 1 if skill.lower() in x.lower() else 0)

In [14]:
df_main["combined_bi"] = df_main["bi tool"] +  df_main["power bi"]
df_main.head()

,index,title,company_name,location,via,description,extensions,schedule_type,work_from_home,salary,...,python,sql,tableau,bi tool,power bi,aws,azure,excel,powerpoint,combined_bi
0,0,data analyst,Cisco Meraki,Anywhere,via linkedin,"as the leader in cloud-managed it, cisco merak...","['22 hours ago', 'Work from home', 'Full-time'...",Full-time,True,<NA>,...,0,1,1,1,0,1,0,0,0,1
1,1,entry level - business data analyst (remote),Midwest Staffing,Anywhere,via linkedin,as a senior business analyst you will contribu...,"['53 minutes ago', 'Work from home', 'Full-tim...",Full-time,True,<NA>,...,0,0,0,0,0,0,0,0,0,0
2,2,data analyst/researcher,"Amyx, Inc.",United States,via indeed,overview: amyx is seeking to hire a data anal...,"['3 hours ago', 'Full-time']",Full-time,True,<NA>,...,0,1,0,0,0,1,1,1,0,0
3,3,data analyst/ai expert to help build a website...,Upwork,Anywhere,via upwork,i am looking for someone to help me build an a...,"['23 hours ago', 'Work from home', 'Contractor']",Contractor,True,<NA>,...,0,0,0,0,0,0,0,1,0,0
4,4,data analyst,Bank Street College of Education,United States,via higher education recruitment consortium (h...,position vacancy – data analyst to support the...,"['20 hours ago', 'Full-time']",Full-time,True,<NA>,...,0,0,0,0,0,0,0,1,1,0

In [15]:
df_main[["python", "sql", "tableau", "aws", "azure", "excel", "powerpoint", "combined_bi"]].sum(axis=0).sort_values(ascending = False)

excel          19554
sql            19526
python         10874
tableau        10578
combined_bi     8249
aws             4603
powerpoint      2970
azure           2034
dtype: int64

In [ ]:
#idee zeitlich abbilden der einzlenmen skills und prozente

In [ ]:
# NLP + DOESNT WORK because skill doesnt exist
nlp = spacy.load("en_core_web_sm")

#function to extract skills using spacy
def extract_skills(text):
    doc = nlp(text)
    skills = [ent.text.lower() for ent in doc.ents if ent.label_ == "SKILL"]
    return list(set(skills))

# Apply the function to create a new column
df_main['extracted_skills'] = df['description'].apply(extract_skills)

In [ ]:
# imports SKILLNER
import spacy
from spacy.matcher import PhraseMatcher

# load default skills data base
from skillNer.general_params import SKILL_DB # EMSI skills database 
# import skill extractor
from skillNer.skill_extractor_class import SkillExtractor

In [ ]:
# init params of skill extractor
nlp = spacy.load("en_core_web_lg")
# init skill extractor
skill_extractor = SkillExtractor(nlp, SKILL_DB, PhraseMatcher)

# extract skills from job_description
job_description = """
You are a Python developer with a solid experience in web development
and can manage projects. You quickly adapt to new environments
and speak fluently English and French
"""

annotations = skill_extractor.annotate(job_description)

In [ ]:
print(annotations)

In [ ]:
#for later

In [ ]:
# here there are no entries in the new column named entity# Iterate over the DataFrame and check for non-empty named entity values
for index, row in df_main.iterrows():
    named_entities = row['named_entities']
    if named_entities:
        print(f"At index {index}, named entities found: {named_entities}")
    else:
        print(f"At index {index}, no named entities found.")

In [ ]:
# check how many unique types SpaCy here in our df has found?# Initialize a dictionary to count the occurrences of each named entity type
entity_types_count = {}# Iterate over the named entities found in each row and count the occurrences of each type
for entities in df['named_entities']:
    for entity in entities:
        entity_type = entity[1]  # Extract the entity type
        if entity_type in entity_types_count:
            entity_types_count[entity_type] += 1
        else:
            entity_types_count[entity_type] = 1# Display the count of occurrences for each named entity type
for entity_type, count in entity_types_count.items():
    print(f"{entity_type}: {count}")

In [ ]:
# try sth. else and searching for job related components which should be defined in advance e.g.import spacy# Load the pre-trained NLP model
nlp = spacy.load("en_core_web_sm")# Define keywords or phrases
keywords = ["Python", "SQL", "Tableau", "Code", "Coden"]# Function to extract usernames with relevant keywords
def extract_job_related_usernames(df):
    job_related_usernames = []
    for username in df['username']:
        doc = nlp(username)
        for token in doc:
            if token.text in keywords:
                job_related_usernames.append(username)
                break  # Once a keyword is found, move to the next username
    return job_related_usernames# Extract usernames with relevant keywords
job_related_usernames = extract_job_related_usernames(df)# Display the extracted usernames
print(job_related_usernames)
16:15 Uhr
# Count the number of job-related usernames
job_related_usernames_count = len(job_related_usernames)# Display the count
print("Number of job-related usernames:", job_related_usernames_count)

In [ ]:
df = pd.read_csv('data/gsearch_jobs.csv')

In [ ]:
df.tail()

In [ ]:
df.info()
df.shape

In [ ]:
#Getting to know the dataset
display(df["location"].value_counts())
germany = df["location"].value_counts().get('Germany')
print(germany)
display(df["title"].value_counts())

In [ ]:
df["title"] = df["title"].astype("string")
print(df["title"].dtype)
df.info()

In [ ]:
df["title"] = df["title"].fillna('')

In [ ]:
#covert to lower strings
df["title"] = df["title"].apply(lambda x: x.lower() if isinstance(x, str) else x)
df["description"] = df["description"].apply(lambda x: x.lower() if isinstance(x, str) else x)
df.head()

In [ ]:
df["description"].value_counts()

In [ ]:
# checking how many data analyst and scientists / may still overlap
df["is_analyst"] = df['title'].str.contains('data analyst', case=False)
print(df["is_analyst"].sum())
df["is_analyst"] = df['title'].str.contains('business data analyst', case=False)
print(df["is_analyst"].sum())
df["is_science"] = df['title'].str.contains('scient' or 'scienc', case=False)
print(df["is_science"].sum())
df["is_analyst"] = df['title'].str.contains('business analyst', case=False)
print(df["is_analyst"].sum())

In [ ]:
#starting tokenization
skills_list = ["python", "sql", "tableau", "bi"]  # start with these two skills

# create new columns for each skill
for skill in skills_list:
    df[skill] = df['description'].apply(lambda x: 1 if skill.lower() in x.lower() else 0)

df.head()

In [ ]:
# NLP
nlp = spacy.load("en_core_web_sm")

#function to extract skills using spay
def extract_skills(text):
    doc = nlp(text)
    skills = [ent.text.lower() for ent in doc.ents if ent.label_ == "SKILL"]
    return list(set(skills))

# Apply the function to create a new column
df['extracted_skills'] = df['description'].apply(extract_skills)